daily-work/w5/w5d1/app/controllers/goal_comments_controller.rb

INSERT INTO "goal_comments" ("body", "goal_id", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "asdf"], ["goal_id", 4], ["author_id", 7], ["created_at", "2015-11-24 01:02:54.482934"], ["updated_at", "2015-11-24 01:02:54.482934"]]
---
  def create
    @goal_comment = GoalComment.new(goal_comment_params)
    @goal_comment.save

SELECT  "goal_comments".* FROM "goal_comments" WHERE "goal_comments"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "goal_comments" WHERE "goal_comments"."id" = ?  [["id", 2]]
---
  def destroy
    @goal_comment = GoalComment.find(params[:id])
    goal_id = @goal_comment.goal_id
    @goal_comment.destroy