daily-work/w5/w5d1/app/controllers/user_comments_controller.rb

INSERT INTO "user_comments" ("body", "user_id", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "aweoifjiwjrg"], ["user_id", 3], ["author_id", 3], ["created_at", "2015-11-24 01:36:16.599982"], ["updated_at", "2015-11-24 01:36:16.599982"]]
---
  def create
    @user_comment = UserComment.new(user_comment_params)
    @user_comment.save

SELECT  "user_comments".* FROM "user_comments" WHERE "user_comments"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "user_comments" WHERE "user_comments"."id" = ?  [["id", 2]]
---
  def destroy
    @user_comment = UserComment.find(params[:id])
    user_id = @user_comment.user_id
    @user_comment.destroy