daily-work/w5/w5d1/GoalApp/app/views/goal_comments/_comments.html.erb

SELECT "goal_comments".* FROM "goal_comments" WHERE "goal_comments"."goal_id" = ?  [["goal_id", 3]]
---
<% @goal.comments.each do |comment| %>