daily-work/w5/w5d1/app/views/user_comments/_comments.html.erb

SELECT "user_comments".* FROM "user_comments" WHERE "user_comments"."user_id" = ?  [["user_id", 3]]
---
<% @user.comments_about.each do |comment| %>