daily-work/w5/w5d1/GoalApp/app/controllers/goals_controller.rb

INSERT INTO "goals" ("body", "public", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Run everyday"], ["public", "t"], ["user_id", 4], ["created_at", "2015-11-23 22:36:37.826459"], ["updated_at", "2015-11-23 22:36:37.826459"]]
---
  def create
    @goal = Goal.new(goal_params)

    if @goal.save

UPDATE "goals" SET "body" = ?, "public" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["body", "dsafsd new"], ["public", "f"], ["updated_at", "2015-11-24 00:56:08.354557"], ["id", 7]]
---
  def update
    @goal = current_goal

    if @goal.update(goal_params)

DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 1]]
---
  def destroy
    @goal = current_goal
    user_id = @goal.user_id
    @goal.destroy